# RefersToExternalResourceReference Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Element..::..RefersToExternalResourceReference Method
Element Class See Also
---
Determines whether this Element uses external resources associated with a specified external resource type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public bool RefersToExternalResourceReference(
	ExternalResourceType resourceType
)
```

Visual Basic
---
```text
Public Function RefersToExternalResourceReference ( _
	resourceType As ExternalResourceType _
) As Boolean
```

Visual C++
---
```text
public:
bool RefersToExternalResourceReference(
	ExternalResourceType^ resourceType
)
```

# ### Parameters
resourceType
    Type: Autodesk.Revit.DB..::..ExternalResourceType The desired external resource type.
# ### Return Value
Returns true if this Element uses external resources associated with the specified external resource type; otherwise, false.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
Element Class
Autodesk.Revit.DB Namespace